Revit 2027 API
IFCExtrusionData Constructor
 Constructs a new empty extrusion data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExtrusionData()
Public Sub New
public:
IFCExtrusionData()
new : unit -> IFCExtrusionData
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace